D={ "Одеська": "Площа 33 310км2", "Днiпропетровська": "Площа 31 914 км2", "Чернiгiвська":"Площа 31 865км2", "Харківська": "Площа 31 415км2", "Житомирська": "Площа 29 832КМ2 "} 
print ("1 - щоб додати, 2 - для пошуку. З - для видалення, 4 - для завершення")
n=0 
while not n==1:
    a=int(input("Цифра ")) 
    if a==1:
        b=(input("Область ")) 
        c=(input("Площа "))
        D[b]="Площа: "+c+"км2" 
    elif a==2:
        b=(input("Область "))
        if b in D:
            print(D[b]) 
        else:
            print("Така область в словнику відсутня")
    elif a==3:
        b=(input("Яку область видалити?"))
        if b in D:
            D.pop(b)
        else: 
            print("Така область в словнику відсутня")
    elif a==4:
        break
    else:
        print("Не приймає таке значення")
print(D)